PX4/PX4-Autopilot/platforms/nuttx/src/px4/stm/stm32_common/dshot/dshot.c
	// Disable capture DMA
	io_timer_capture_dma_req(timer_index, capture_channel, false);

	// Stop DMA (should already be finished)
	stm32_dmastop(timer_configs[timer_index].dma_handle);

	// Re-initialize all output channels on this timer
	for (uint8_t output_channel = 0; output_channel < MAX_TIMER_IO_CHANNELS; output_channel++) {

		bool is_this_timer = timer_index == timer_io_channels[output_channel].timer_index;
		uint8_t timer_channel_index = timer_io_channels[output_channel].timer_channel - 1;
		bool channel_initialized = timer_configs[timer_index].initialized_channels[timer_channel_index];

		if (is_this_timer && channel_initialized) {
			io_timer_unallocate_channel(output_channel);
			// Initialize back to DShotInverted to bring IO back to the expected idle state
			io_timer_channel_init(output_channel, IOTimerChanMode_DshotInverted, NULL, NULL);
		}
	}

	// Invalidate the dcache to ensure most recent data is available
	up_invalidate_dcache((uintptr_t) dshot_capture_buffer,
			     (uintptr_t) dshot_capture_buffer + DSHOT_CAPTURE_BUFFER_SIZE(MAX_NUM_CHANNELS_PER_TIMER));

	// Process eRPM frames from all channels on this timer
	process_capture_results(timer_index, capture_channel);

	// Enable all channels configured as DShotInverted
	io_timer_set_enable(true, IOTimerChanMode_DshotInverted, IO_TIMER_ALL_MODES_CHANNELS);

	perf_end(hrt_callback_perf);

	_bdshot_cycle_complete = true;
}

void process_capture_results(uint8_t timer_index, uint8_t channel_index)
{
	(void)timer_index; // NOTE: in the current implementation only 1 timer is used
	uint8_t output_channel = output_channel_from_timer_channel(timer_index, channel_index);
	uint32_t value = convert_edge_intervals_to_bitstream(channel_index);

	// Decode RLL
	value = (value ^ (value >> 1));

	// Decode GCR
	uint32_t payload = gcr_decode[value & 0x1f];
	payload |= gcr_decode[(value >> 5) & 0x1f] << 4;
	payload |= gcr_decode[(value >> 10) & 0x1f] << 8;
	payload |= gcr_decode[(value >> 15) & 0x1f] << 12;

	// Calculate checksum
	uint32_t checksum = payload;
	checksum = checksum ^ (checksum >> 8);
	checksum = checksum ^ (checksum >> NIBBLES_SIZE);

	if ((checksum & 0xF) != 0xF) {
		++read_fail_crc[output_channel];

		if (_consecutive_failures[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
			_consecutive_failures[output_channel] = BDSHOT_OFFLINE_COUNT;
			_consecutive_successes[output_channel] = 0;
			_bdshot_online[output_channel] = false;
		}

		_bdshot_processed[output_channel] = true;
		return;
	}

	++read_ok[output_channel];

	if (_consecutive_successes[output_channel]++ > BDSHOT_OFFLINE_COUNT) {
		_consecutive_successes[output_channel] = BDSHOT_OFFLINE_COUNT;
		_consecutive_failures[output_channel] = 0;
		_bdshot_online[output_channel] = true;
	}

	// Convert payload into telem type/value
	struct BDShotTelemetry packet = {};
	payload = (payload >> 4) & 0xFFF;
	decode_dshot_telemetry(payload, &packet);

	hrt_abstime now = hrt_absolute_time();

	switch (packet.type) {
	case DSHOT_EDT_ERPM: {
			_erpms[output_channel].erpm = packet.value;
			_erpms[output_channel].ready = true;

			uint64_t last_timestamp = _erpms[output_channel].last_timestamp;
			float last_rate_hz = _erpms[output_channel].rate_hz;
			_erpms[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_erpms[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_TEMPERATURE: {
			_edt_temp[output_channel].value = packet.value;
			_edt_temp[output_channel].ready = true;

			uint64_t last_timestamp = _edt_temp[output_channel].last_timestamp;
			float last_rate_hz = _edt_temp[output_channel].rate_hz;
			_edt_temp[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_temp[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_VOLTAGE: {
			_edt_volt[output_channel].value = packet.value;
			_edt_volt[output_channel].ready = true;

			uint64_t last_timestamp = _edt_volt[output_channel].last_timestamp;
			float last_rate_hz = _edt_volt[output_channel].rate_hz;
			_edt_volt[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_volt[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_CURRENT: {
			_edt_curr[output_channel].value = packet.value;
			_edt_curr[output_channel].ready = true;

			uint64_t last_timestamp = _edt_curr[output_channel].last_timestamp;
			float last_rate_hz = _edt_curr[output_channel].rate_hz;
			_edt_curr[output_channel].rate_hz = calculate_rate_hz(last_timestamp, last_rate_hz, now);
			_edt_curr[output_channel].last_timestamp = now;
			break;
		}

	case DSHOT_EDT_STATE_EVENT:
		// TODO: Handle these?
		break;

	default:
		PX4_WARN("unknown EDT type %d", packet.type);
		break;
	}

	_bdshot_processed[output_channel] = true;
}

float calculate_rate_hz(uint64_t last_timestamp, float last_rate_hz, uint64_t timestamp)
{
	if (last_timestamp == 0 || timestamp <= last_timestamp) {
		return last_rate_hz;
	}

	uint64_t dt_us = timestamp - last_timestamp;

	float instant_rate = 1000000.0f / dt_us;

	// Simple exponential moving average with fixed alpha
	// Alpha = 0.125 (1/8) works well across all rates
	float rate_hz = instant_rate * 0.125f + last_rate_hz * 0.875f;

	return rate_hz;
}

// Converts captured edge timestamps into a raw bit stream.
// Measures the time intervals between signal edges to determine how many consecutive
// 1s or 0s to shift in, alternating the bit value with each edge transition.
// Returns a 20 bit raw value that still needs RLL and GCR decoding.
uint32_t convert_edge_intervals_to_bitstream(uint8_t channel_index)
{
	uint32_t value = 0;
	uint32_t high = 1; // We start off with high
	unsigned shifted = 0;

	// We can ignore the very first data point as it's the pulse before it starts.
	unsigned previous = dshot_capture_buffer[channel_index][1];

	// Loop through the capture buffer for the specified channel
	for (unsigned i = 2; i < CHANNEL_CAPTURE_BUFF_SIZE; ++i) {

		if (dshot_capture_buffer[channel_index][i] == 0) {
			// Once we get zeros we're through
			break;
		}

		// This seemss to work with dshot 150, 300, 600, 1200
		// The values were found by trial and error to get the quantization just right.
		const uint32_t bits = (dshot_capture_buffer[channel_index][i] - previous + 5) / 21;

